#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ClashBot/ClashBot/runs/run-Lq4ZBsCa7QbLmg2B

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_cluster.clash-bot-cluster will be created
  + resource "aws_ecs_cluster" "clash-bot-cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "clash-bot-tfe-ecs"
      + tags               = {
          + "Name" = "ClashBotDiscordBot"
          + "Type" = "Bot"
        }
      + tags_all           = {
          + "Name" = "ClashBotDiscordBot"
          + "Type" = "Bot"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + arn  = (sensitive value)
  + name = "clash-bot-tfe-ecs"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*